hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_tamp.h
#define	TAMP_FLTCR_TAMPPUDIS			(0x1u<<7)
#define	TAMP_FLTCR_TAMPPRCH				(0x3u<<5)
#define	TAMP_FLTCR_TAMPPRCH_0			(0x1u<<5)
#define	TAMP_FLTCR_TAMPFLT				(0x3u<<3)
#define	TAMP_FLTCR_TAMPFLT_0			(0x1u<<3)
#define	TAMP_FLTCR_TAMPFREQ				(0x7u<<0)
#define	TAMP_FLTCR_TAMPFREQ_0			(0x1u<<0)

#define	TAMP_FLTCR_TAMPPUDIS_B_0X0		(0x0u<<7)
#define	TAMP_FLTCR_TAMPPUDIS_B_0X1		(0x1u<<7)
#define	TAMP_FLTCR_TAMPPRCH_B_0X0		(0x0u<<5)
#define	TAMP_FLTCR_TAMPPRCH_B_0X1		(0x1u<<5)
#define	TAMP_FLTCR_TAMPPRCH_B_0X2		(0x2u<<5)
#define	TAMP_FLTCR_TAMPPRCH_B_0X3		(0x3u<<5)
#define	TAMP_FLTCR_TAMPFLT_B_0X0		(0x0u<<3)
#define	TAMP_FLTCR_TAMPFLT_B_0X1		(0x1u<<3)
#define	TAMP_FLTCR_TAMPFLT_B_0X2		(0x2u<<3)
#define	TAMP_FLTCR_TAMPFLT_B_0X3		(0x3u<<3)
#define	TAMP_FLTCR_TAMPFREQ_B_0X0		(0x0u<<0)
#define	TAMP_FLTCR_TAMPFREQ_B_0X1		(0x1u<<0)
#define	TAMP_FLTCR_TAMPFREQ_B_0X2		(0x2u<<0)
#define	TAMP_FLTCR_TAMPFREQ_B_0X3		(0x3u<<0)
#define	TAMP_FLTCR_TAMPFREQ_B_0X4		(0x4u<<0)
#define	TAMP_FLTCR_TAMPFREQ_B_0X5		(0x5u<<0)
#define	TAMP_FLTCR_TAMPFREQ_B_0X6		(0x6u<<0)
#define	TAMP_FLTCR_TAMPFREQ_B_0X7		(0x7u<<0)

// ATCR1 Configuration

#define	TAMP_ATCR1_FLTEN				(0x1u<<31)
#define	TAMP_ATCR1_ATOSHARE				(0x1u<<30)
#define	TAMP_ATCR1_ATPER				(0x7u<<24)
#define	TAMP_ATCR1_ATPER_0				(0x1u<<24)
#define	TAMP_ATCR1_ATCKSEL				(0xFu<<16)
#define	TAMP_ATCR1_ATCKSEL_0			(0x1u<<16)
#define	TAMP_ATCR1_ATOSEL4				(0x3u<<14)
#define	TAMP_ATCR1_ATOSEL4_0			(0x1u<<14)
#define	TAMP_ATCR1_ATOSEL3				(0x3u<<12)
#define	TAMP_ATCR1_ATOSEL3_0			(0x1u<<12)
#define	TAMP_ATCR1_ATOSEL2				(0x3u<<10)
#define	TAMP_ATCR1_ATOSEL2_0			(0x1u<<10)
#define	TAMP_ATCR1_ATOSEL1				(0x3u<<8)
#define	TAMP_ATCR1_ATOSEL1_0			(0x1u<<8)
#define	TAMP_ATCR1_TAMP7AM				(0x1u<<6)
#define	TAMP_ATCR1_TAMP6AM				(0x1u<<5)
#define	TAMP_ATCR1_TAMP5AM				(0x1u<<4)
#define	TAMP_ATCR1_TAMP4AM				(0x1u<<3)
#define	TAMP_ATCR1_TAMP3AM				(0x1u<<2)
#define	TAMP_ATCR1_TAMP2AM				(0x1u<<1)
#define	TAMP_ATCR1_TAMP1AM				(0x1u<<0)

#define	TAMP_ATCR1_FLTEN_B_0X0			(0x0u<<31)
#define	TAMP_ATCR1_FLTEN_B_0X1			(0x1u<<31)
#define	TAMP_ATCR1_ATOSHARE_B_0X0		(0x0u<<30)
#define	TAMP_ATCR1_ATOSHARE_B_0X1		(0x1u<<30)
#define	TAMP_ATCR1_ATOSEL4_B_0X0		(0x0u<<14)
#define	TAMP_ATCR1_ATOSEL4_B_0X1		(0x1u<<14)
#define	TAMP_ATCR1_ATOSEL4_B_0X2		(0x2u<<14)
#define	TAMP_ATCR1_ATOSEL4_B_0X3		(0x3u<<14)
#define	TAMP_ATCR1_ATOSEL3_B_0X0		(0x0u<<12)
#define	TAMP_ATCR1_ATOSEL3_B_0X1		(0x1u<<12)
#define	TAMP_ATCR1_ATOSEL3_B_0X2		(0x2u<<12)
#define	TAMP_ATCR1_ATOSEL3_B_0X3		(0x3u<<12)
#define	TAMP_ATCR1_ATOSEL2_B_0X0		(0x0u<<10)
#define	TAMP_ATCR1_ATOSEL2_B_0X1		(0x1u<<10)
#define	TAMP_ATCR1_ATOSEL2_B_0X2		(0x2u<<10)
#define	TAMP_ATCR1_ATOSEL2_B_0X3		(0x3u<<10)
#define	TAMP_ATCR1_ATOSEL1_B_0X0		(0x0u<<8)
#define	TAMP_ATCR1_ATOSEL1_B_0X1		(0x1u<<8)
#define	TAMP_ATCR1_ATOSEL1_B_0X2		(0x2u<<8)
#define	TAMP_ATCR1_ATOSEL1_B_0X3		(0x3u<<8)
#define	TAMP_ATCR1_TAMP7AM_B_0X0		(0x0u<<6)
#define	TAMP_ATCR1_TAMP7AM_B_0X1		(0x1u<<6)
#define	TAMP_ATCR1_TAMP6AM_B_0X0		(0x0u<<5)
#define	TAMP_ATCR1_TAMP6AM_B_0X1		(0x1u<<5)
#define	TAMP_ATCR1_TAMP5AM_B_0X0		(0x0u<<4)
#define	TAMP_ATCR1_TAMP5AM_B_0X1		(0x1u<<4)
#define	TAMP_ATCR1_TAMP4AM_B_0X0		(0x0u<<3)
#define	TAMP_ATCR1_TAMP4AM_B_0X1		(0x1u<<3)
#define	TAMP_ATCR1_TAMP3AM_B_0X0		(0x0u<<2)
#define	TAMP_ATCR1_TAMP3AM_B_0X1		(0x1u<<2)
#define	TAMP_ATCR1_TAMP2AM_B_0X0		(0x0u<<1)
#define	TAMP_ATCR1_TAMP2AM_B_0X1		(0x1u<<1)
#define	TAMP_ATCR1_TAMP1AM_B_0X0		(0x0u<<0)
#define	TAMP_ATCR1_TAMP1AM_B_0X1		(0x1u<<0)

// ATSEEDR Configuration

#define	TAMP_ATSEEDR_SEED				(0xFFFFFFFFu<<0)
#define	TAMP_ATSEEDR_SEED_0				(0x1u<<0)

// ATOR Configuration

#define	TAMP_ATOR_INITS					(0x1u<<15)
#define	TAMP_ATOR_SEEDF					(0x1u<<14)
#define	TAMP_ATOR_PRNG					(0xFFu<<0)
#define	TAMP_ATOR_PRNG_0				(0x1u<<0)

// ATCR2 Configuration

#define	TAMP_ATCR2_ATOSEL7				(0x7u<<26)
#define	TAMP_ATCR2_ATOSEL7_0			(0x1u<<26)
#define	TAMP_ATCR2_ATOSEL6				(0x7u<<23)
#define	TAMP_ATCR2_ATOSEL6_0			(0x1u<<23)
#define	TAMP_ATCR2_ATOSEL5				(0x7u<<20)
#define	TAMP_ATCR2_ATOSEL5_0			(0x1u<<20)
#define	TAMP_ATCR2_ATOSEL4				(0x7u<<17)
#define	TAMP_ATCR2_ATOSEL4_0			(0x1u<<17)
#define	TAMP_ATCR2_ATOSEL3				(0x7u<<14)
#define	TAMP_ATCR2_ATOSEL3_0			(0x1u<<14)
#define	TAMP_ATCR2_ATOSEL2				(0x7u<<11)
#define	TAMP_ATCR2_ATOSEL2_0			(0x1u<<11)
#define	TAMP_ATCR2_ATOSEL1				(0x7u<<8)
#define	TAMP_ATCR2_ATOSEL1_0			(0x1u<<8)

#define	TAMP_ATCR2_ATOSEL7_B_0X0		(0x0u<<26)
#define	TAMP_ATCR2_ATOSEL7_B_0X1		(0x1u<<26)
#define	TAMP_ATCR2_ATOSEL7_B_0X2		(0x2u<<26)
#define	TAMP_ATCR2_ATOSEL7_B_0X3		(0x3u<<26)
#define	TAMP_ATCR2_ATOSEL7_B_0X4		(0x4u<<26)
#define	TAMP_ATCR2_ATOSEL7_B_0X5		(0x5u<<26)
#define	TAMP_ATCR2_ATOSEL7_B_0X6		(0x6u<<26)
#define	TAMP_ATCR2_ATOSEL7_B_0X7		(0x7u<<26)
#define	TAMP_ATCR2_ATOSEL6_B_0X0		(0x0u<<23)
#define	TAMP_ATCR2_ATOSEL6_B_0X1		(0x1u<<23)
#define	TAMP_ATCR2_ATOSEL6_B_0X2		(0x2u<<23)
#define	TAMP_ATCR2_ATOSEL6_B_0X3		(0x3u<<23)
#define	TAMP_ATCR2_ATOSEL6_B_0X4		(0x4u<<23)
#define	TAMP_ATCR2_ATOSEL6_B_0X5		(0x5u<<23)
#define	TAMP_ATCR2_ATOSEL6_B_0X6		(0x6u<<23)
#define	TAMP_ATCR2_ATOSEL6_B_0X7		(0x7u<<23)
#define	TAMP_ATCR2_ATOSEL5_B_0X0		(0x0u<<20)
#define	TAMP_ATCR2_ATOSEL5_B_0X1		(0x1u<<20)
#define	TAMP_ATCR2_ATOSEL5_B_0X2		(0x2u<<20)
#define	TAMP_ATCR2_ATOSEL5_B_0X3		(0x3u<<20)
#define	TAMP_ATCR2_ATOSEL5_B_0X4		(0x4u<<20)
#define	TAMP_ATCR2_ATOSEL5_B_0X5		(0x5u<<20)
#define	TAMP_ATCR2_ATOSEL5_B_0X6		(0x6u<<20)
#define	TAMP_ATCR2_ATOSEL5_B_0X7		(0x7u<<20)
#define	TAMP_ATCR2_ATOSEL4_B_0X0		(0x0u<<17)
#define	TAMP_ATCR2_ATOSEL4_B_0X1		(0x1u<<17)
#define	TAMP_ATCR2_ATOSEL4_B_0X2		(0x2u<<17)
#define	TAMP_ATCR2_ATOSEL4_B_0X3		(0x3u<<17)
#define	TAMP_ATCR2_ATOSEL4_B_0X4		(0x4u<<17)
#define	TAMP_ATCR2_ATOSEL4_B_0X5		(0x5u<<17)
#define	TAMP_ATCR2_ATOSEL4_B_0X6		(0x6u<<17)
#define	TAMP_ATCR2_ATOSEL4_B_0X7		(0x7u<<17)
#define	TAMP_ATCR2_ATOSEL3_B_0X0		(0x0u<<14)
#define	TAMP_ATCR2_ATOSEL3_B_0X1		(0x1u<<14)
#define	TAMP_ATCR2_ATOSEL3_B_0X2		(0x2u<<14)
#define	TAMP_ATCR2_ATOSEL3_B_0X3		(0x3u<<14)
#define	TAMP_ATCR2_ATOSEL3_B_0X4		(0x4u<<14)
#define	TAMP_ATCR2_ATOSEL3_B_0X5		(0x5u<<14)
#define	TAMP_ATCR2_ATOSEL3_B_0X6		(0x6u<<14)
#define	TAMP_ATCR2_ATOSEL3_B_0X7		(0x7u<<14)
#define	TAMP_ATCR2_ATOSEL2_B_0X0		(0x0u<<11)
#define	TAMP_ATCR2_ATOSEL2_B_0X1		(0x1u<<11)
#define	TAMP_ATCR2_ATOSEL2_B_0X2		(0x2u<<11)
#define	TAMP_ATCR2_ATOSEL2_B_0X3		(0x3u<<11)
#define	TAMP_ATCR2_ATOSEL2_B_0X4		(0x4u<<11)
#define	TAMP_ATCR2_ATOSEL2_B_0X5		(0x5u<<11)
#define	TAMP_ATCR2_ATOSEL2_B_0X6		(0x6u<<11)
#define	TAMP_ATCR2_ATOSEL2_B_0X7		(0x7u<<11)
#define	TAMP_ATCR2_ATOSEL1_B_0X0		(0x0u<<8)
#define	TAMP_ATCR2_ATOSEL1_B_0X1		(0x1u<<8)
#define	TAMP_ATCR2_ATOSEL1_B_0X2		(0x2u<<8)
#define	TAMP_ATCR2_ATOSEL1_B_0X3		(0x3u<<8)
#define	TAMP_ATCR2_ATOSEL1_B_0X4		(0x4u<<8)
#define	TAMP_ATCR2_ATOSEL1_B_0X5		(0x5u<<8)
#define	TAMP_ATCR2_ATOSEL1_B_0X6		(0x6u<<8)
#define	TAMP_ATCR2_ATOSEL1_B_0X7		(0x7u<<8)

