hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_tamp.h
// SECCFGR Configuration

#define	TAMP_SECCFGR_TAMPSEC			(0x1u<<31)
#define	TAMP_SECCFGR_BHKLOCK			(0x1u<<30)
#define	TAMP_SECCFGR_BKPWSEC			(0xFFu<<16)
#define	TAMP_SECCFGR_BKPWSEC_0			(0x1u<<16)
#define	TAMP_SECCFGR_CNT1SEC			(0x1u<<15)
#define	TAMP_SECCFGR_BKPRWSEC			(0xFFu<<0)
#define	TAMP_SECCFGR_BKPRWSEC_0			(0x1u<<0)

#define	TAMP_SECCFGR_TAMPSEC_B_0X0		(0x0u<<31)
#define	TAMP_SECCFGR_TAMPSEC_B_0X1		(0x1u<<31)
#define	TAMP_SECCFGR_BHKLOCK_B_0X0		(0x0u<<30)
#define	TAMP_SECCFGR_BHKLOCK_B_0X1		(0x1u<<30)
#define	TAMP_SECCFGR_CNT1SEC_B_0X0		(0x0u<<15)
#define	TAMP_SECCFGR_CNT1SEC_B_0X1		(0x1u<<15)

// PRIVCFGR Configuration

#define	TAMP_PRIVCFGR_TAMPPRIV			(0x1u<<31)
#define	TAMP_PRIVCFGR_BKPWPRIV			(0x1u<<30)
#define	TAMP_PRIVCFGR_BKPRWPRIV			(0x1u<<29)
#define	TAMP_PRIVCFGR_CNT1PRIV			(0x1u<<15)

#define	TAMP_PRIVCFGR_TAMPPRIV_B_0X0	(0x0u<<31)
#define	TAMP_PRIVCFGR_TAMPPRIV_B_0X1	(0x1u<<31)
#define	TAMP_PRIVCFGR_BKPWPRIV_B_0X0	(0x0u<<30)
#define	TAMP_PRIVCFGR_BKPWPRIV_B_0X1	(0x1u<<30)
#define	TAMP_PRIVCFGR_BKPRWPRIV_B_0X0	(0x0u<<29)
#define	TAMP_PRIVCFGR_BKPRWPRIV_B_0X1	(0x1u<<29)
#define	TAMP_PRIVCFGR_CNT1PRIV_B_0X0	(0x0u<<15)
#define	TAMP_PRIVCFGR_CNT1PRIV_B_0X1	(0x1u<<15)

// IER Configuration

#define	TAMP_IER_ITAMP11IE				(0x1u<<26)
#define	TAMP_IER_ITAMP9IE				(0x1u<<24)
#define	TAMP_IER_ITAMP8IE				(0x1u<<23)
#define	TAMP_IER_ITAMP7IE				(0x1u<<22)
#define	TAMP_IER_ITAMP6IE				(0x1u<<21)
#define	TAMP_IER_ITAMP5IE				(0x1u<<20)
#define	TAMP_IER_ITAMP4IE				(0x1u<<19)
#define	TAMP_IER_ITAMP3IE				(0x1u<<18)
#define	TAMP_IER_ITAMP2IE				(0x1u<<17)
#define	TAMP_IER_ITAMP1IE				(0x1u<<16)
#define	TAMP_IER_TAMP7IE				(0x1u<<6)
#define	TAMP_IER_TAMP6IE				(0x1u<<5)
#define	TAMP_IER_TAMP5IE				(0x1u<<4)
#define	TAMP_IER_TAMP4IE				(0x1u<<3)
#define	TAMP_IER_TAMP3IE				(0x1u<<2)
#define	TAMP_IER_TAMP2IE				(0x1u<<1)
#define	TAMP_IER_TAMP1IE				(0x1u<<0)

#define	TAMP_IER_ITAMP11IE_B_0X0		(0x0u<<26)
#define	TAMP_IER_ITAMP11IE_B_0X1		(0x1u<<26)
#define	TAMP_IER_ITAMP9IE_B_0X0			(0x0u<<24)
#define	TAMP_IER_ITAMP9IE_B_0X1			(0x1u<<24)
#define	TAMP_IER_ITAMP8IE_B_0X0			(0x0u<<23)
#define	TAMP_IER_ITAMP8IE_B_0X1			(0x1u<<23)
#define	TAMP_IER_ITAMP7IE_B_0X0			(0x0u<<22)
#define	TAMP_IER_ITAMP7IE_B_0X1			(0x1u<<22)
#define	TAMP_IER_ITAMP6IE_B_0X0			(0x0u<<21)
#define	TAMP_IER_ITAMP6IE_B_0X1			(0x1u<<21)
#define	TAMP_IER_ITAMP5IE_B_0X0			(0x0u<<20)
#define	TAMP_IER_ITAMP5IE_B_0X1			(0x1u<<20)
#define	TAMP_IER_ITAMP4IE_B_0X0			(0x0u<<19)
#define	TAMP_IER_ITAMP4IE_B_0X1			(0x1u<<19)
#define	TAMP_IER_ITAMP3IE_B_0X0			(0x0u<<18)
#define	TAMP_IER_ITAMP3IE_B_0X1			(0x1u<<18)
#define	TAMP_IER_ITAMP2IE_B_0X0			(0x0u<<17)
#define	TAMP_IER_ITAMP2IE_B_0X1			(0x1u<<17)
#define	TAMP_IER_ITAMP1IE_B_0X0			(0x0u<<16)
#define	TAMP_IER_ITAMP1IE_B_0X1			(0x1u<<16)
#define	TAMP_IER_TAMP7IE_B_0X0			(0x0u<<6)
#define	TAMP_IER_TAMP7IE_B_0X1			(0x1u<<6)
#define	TAMP_IER_TAMP6IE_B_0X0			(0x0u<<5)
#define	TAMP_IER_TAMP6IE_B_0X1			(0x1u<<5)
#define	TAMP_IER_TAMP5IE_B_0X0			(0x0u<<4)
#define	TAMP_IER_TAMP5IE_B_0X1			(0x1u<<4)
#define	TAMP_IER_TAMP4IE_B_0X0			(0x0u<<3)
#define	TAMP_IER_TAMP4IE_B_0X1			(0x1u<<3)
#define	TAMP_IER_TAMP3IE_B_0X0			(0x0u<<2)
#define	TAMP_IER_TAMP3IE_B_0X1			(0x1u<<2)
#define	TAMP_IER_TAMP2IE_B_0X0			(0x0u<<1)
#define	TAMP_IER_TAMP2IE_B_0X1			(0x1u<<1)
#define	TAMP_IER_TAMP1IE_B_0X0			(0x0u<<0)
#define	TAMP_IER_TAMP1IE_B_0X1			(0x1u<<0)

// SR Configuration

#define	TAMP_SR_ITAMP11F				(0x1u<<26)
#define	TAMP_SR_ITAMP9F					(0x1u<<24)
#define	TAMP_SR_ITAMP8F					(0x1u<<23)
#define	TAMP_SR_ITAMP7F					(0x1u<<22)
#define	TAMP_SR_ITAMP6F					(0x1u<<21)
#define	TAMP_SR_ITAMP5F					(0x1u<<20)
#define	TAMP_SR_ITAMP4F					(0x1u<<19)
#define	TAMP_SR_ITAMP3F					(0x1u<<18)
#define	TAMP_SR_ITAMP2F					(0x1u<<17)
#define	TAMP_SR_ITAMP1F					(0x1u<<16)
#define	TAMP_SR_TAMP7F					(0x1u<<6)
#define	TAMP_SR_TAMP6F					(0x1u<<5)
#define	TAMP_SR_TAMP5F					(0x1u<<4)
#define	TAMP_SR_TAMP4F					(0x1u<<3)
#define	TAMP_SR_TAMP3F					(0x1u<<2)
#define	TAMP_SR_TAMP2F					(0x1u<<1)
#define	TAMP_SR_TAMP1F					(0x1u<<0)

// MISR Configuration

#define	TAMP_MISR_ITAMP11MF				(0x1u<<26)
#define	TAMP_MISR_ITAMP9MF				(0x1u<<24)
#define	TAMP_MISR_ITAMP8MF				(0x1u<<23)
#define	TAMP_MISR_ITAMP7MF				(0x1u<<22)
#define	TAMP_MISR_ITAMP6MF				(0x1u<<21)
#define	TAMP_MISR_ITAMP5MF				(0x1u<<20)
#define	TAMP_MISR_ITAMP4MF				(0x1u<<19)
#define	TAMP_MISR_ITAMP3MF				(0x1u<<18)
#define	TAMP_MISR_ITAMP2MF				(0x1u<<17)
#define	TAMP_MISR_ITAMP1MF				(0x1u<<16)
#define	TAMP_MISR_TAMP7MF				(0x1u<<6)
#define	TAMP_MISR_TAMP6MF				(0x1u<<5)
#define	TAMP_MISR_TAMP5MF				(0x1u<<4)
#define	TAMP_MISR_TAMP4MF				(0x1u<<3)
#define	TAMP_MISR_TAMP3MF				(0x1u<<2)
#define	TAMP_MISR_TAMP2MF				(0x1u<<1)
#define	TAMP_MISR_TAMP1MF				(0x1u<<0)

// SMISR Configuration

#define	TAMP_SMISR_ITAMP11MF			(0x1u<<26)
#define	TAMP_SMISR_ITAMP9MF				(0x1u<<24)
#define	TAMP_SMISR_ITAMP8MF				(0x1u<<23)
#define	TAMP_SMISR_ITAMP7MF				(0x1u<<22)
#define	TAMP_SMISR_ITAMP6MF				(0x1u<<21)
#define	TAMP_SMISR_ITAMP5MF				(0x1u<<20)
#define	TAMP_SMISR_ITAMP4MF				(0x1u<<19)
#define	TAMP_SMISR_ITAMP3MF				(0x1u<<18)
#define	TAMP_SMISR_ITAMP2MF				(0x1u<<17)
#define	TAMP_SMISR_ITAMP1MF				(0x1u<<16)
#define	TAMP_SMISR_TAMP7MF				(0x1u<<6)
#define	TAMP_SMISR_TAMP6MF				(0x1u<<5)
#define	TAMP_SMISR_TAMP5MF				(0x1u<<4)
#define	TAMP_SMISR_TAMP4MF				(0x1u<<3)
#define	TAMP_SMISR_TAMP3MF				(0x1u<<2)
#define	TAMP_SMISR_TAMP2MF				(0x1u<<1)
#define	TAMP_SMISR_TAMP1MF				(0x1u<<0)

// SCR Configuration

#define	TAMP_SCR_CITAMP11F				(0x1u<<26)
#define	TAMP_SCR_CITAMP9F				(0x1u<<24)
#define	TAMP_SCR_CITAMP8F				(0x1u<<23)
#define	TAMP_SCR_CITAMP7F				(0x1u<<22)
#define	TAMP_SCR_CITAMP6F				(0x1u<<21)
#define	TAMP_SCR_CITAMP5F				(0x1u<<20)
#define	TAMP_SCR_CITAMP4F				(0x1u<<19)
#define	TAMP_SCR_CITAMP3F				(0x1u<<18)
#define	TAMP_SCR_CITAMP2F				(0x1u<<17)
#define	TAMP_SCR_CITAMP1F				(0x1u<<16)
#define	TAMP_SCR_CTAMP7F				(0x1u<<6)
#define	TAMP_SCR_CTAMP6F				(0x1u<<5)
#define	TAMP_SCR_CTAMP5F				(0x1u<<4)
#define	TAMP_SCR_CTAMP4F				(0x1u<<3)
#define	TAMP_SCR_CTAMP3F				(0x1u<<2)
#define	TAMP_SCR_CTAMP2F				(0x1u<<1)
#define	TAMP_SCR_CTAMP1F				(0x1u<<0)

// COUNT1R Configuration

#define	TAMP_COUNT1R_COUNT				(0xFFFFFFFFu<<0)
#define	TAMP_COUNT1R_COUNT_0			(0x1u<<0)

