hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_tamp.h
// OR Configuration

#define	TAMP_OR_BSEN					(0x1u<<1)
#define	TAMP_OR_VCOREMEN				(0x1u<<0)

#define	TAMP_OR_BSEN_B_0X0				(0x0u<<1)
#define	TAMP_OR_BSEN_B_0X1				(0x1u<<1)
#define	TAMP_OR_VCOREMEN_B_0X0			(0x0u<<0)
#define	TAMP_OR_VCOREMEN_B_0X1			(0x1u<<0)

// RPCFGR Configuration

#define	TAMP_RPCFGR_RPCFG0				(0x1u<<0)

#define	TAMP_RPCFGR_RPCFG0_B_0X0		(0x0u<<0)
#define	TAMP_RPCFGR_RPCFG0_B_0X1		(0x1u<<0)

// BKP0R Configuration

#define	TAMP_BKP0R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP0R_BKP_0				(0x1u<<0)

// BKP1R Configuration

#define	TAMP_BKP1R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP1R_BKP_0				(0x1u<<0)

// BKP2R Configuration

#define	TAMP_BKP2R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP2R_BKP_0				(0x1u<<0)

// BKP3R Configuration

#define	TAMP_BKP3R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP3R_BKP_0				(0x1u<<0)

// BKP4R Configuration

#define	TAMP_BKP4R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP4R_BKP_0				(0x1u<<0)

// BKP5R Configuration

#define	TAMP_BKP5R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP5R_BKP_0				(0x1u<<0)

// BKP6R Configuration

#define	TAMP_BKP6R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP6R_BKP_0				(0x1u<<0)

// BKP7R Configuration

#define	TAMP_BKP7R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP7R_BKP_0				(0x1u<<0)

// BKP8R Configuration

#define	TAMP_BKP8R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP8R_BKP_0				(0x1u<<0)

// BKP9R Configuration

#define	TAMP_BKP9R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP9R_BKP_0				(0x1u<<0)

// BKP10R Configuration

#define	TAMP_BKP10R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP10R_BKP_0				(0x1u<<0)

// BKP11R Configuration

#define	TAMP_BKP11R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP11R_BKP_0				(0x1u<<0)

// BKP12R Configuration

#define	TAMP_BKP12R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP12R_BKP_0				(0x1u<<0)

// BKP13R Configuration

#define	TAMP_BKP13R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP13R_BKP_0				(0x1u<<0)

// BKP14R Configuration

#define	TAMP_BKP14R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP14R_BKP_0				(0x1u<<0)

// BKP15R Configuration

#define	TAMP_BKP15R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP15R_BKP_0				(0x1u<<0)

// BKP16R Configuration

#define	TAMP_BKP16R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP16R_BKP_0				(0x1u<<0)

// BKP17R Configuration

#define	TAMP_BKP17R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP17R_BKP_0				(0x1u<<0)

// BKP18R Configuration

#define	TAMP_BKP18R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP18R_BKP_0				(0x1u<<0)

// BKP19R Configuration

#define	TAMP_BKP19R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP19R_BKP_0				(0x1u<<0)

// BKP20R Configuration

#define	TAMP_BKP20R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP20R_BKP_0				(0x1u<<0)

// BKP21R Configuration

#define	TAMP_BKP21R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP21R_BKP_0				(0x1u<<0)

// BKP22R Configuration

#define	TAMP_BKP22R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP22R_BKP_0				(0x1u<<0)

// BKP23R Configuration

#define	TAMP_BKP23R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP23R_BKP_0				(0x1u<<0)

// BKP24R Configuration

#define	TAMP_BKP24R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP24R_BKP_0				(0x1u<<0)

// BKP25R Configuration

#define	TAMP_BKP25R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP25R_BKP_0				(0x1u<<0)

// BKP26R Configuration

#define	TAMP_BKP26R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP26R_BKP_0				(0x1u<<0)

// BKP27R Configuration

#define	TAMP_BKP27R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP27R_BKP_0				(0x1u<<0)

// BKP28R Configuration

#define	TAMP_BKP28R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP28R_BKP_0				(0x1u<<0)

// BKP29R Configuration

#define	TAMP_BKP29R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP29R_BKP_0				(0x1u<<0)

// BKP30R Configuration

#define	TAMP_BKP30R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP30R_BKP_0				(0x1u<<0)

// BKP31R Configuration

#define	TAMP_BKP31R_BKP					(0xFFFFFFFFu<<0)
#define	TAMP_BKP31R_BKP_0				(0x1u<<0)
